[Killed] PublicVisibility
asset/ProjectWithPsalmBaseline/src/HelloWorld.php:10:5
  */
 class HelloWorld
 {
-    public function takesImplictMixedReturnsIntAndIsCoveredByBaseline($mixture): int
+    protected function takesImplictMixedReturnsIntAndIsCoveredByBaseline($mixture) : int
     {
         return $mixture + 2;
killedBy: HelloWorldTest::testNothingButProvideCoverage
statusReason: 1) HelloWorldTest::testNothingButProvideCoverage
Error: Call to protected method Acme\ProjectWithPsalmBaseline\HelloWorld::takesImplictMixedReturnsIntAndIsCoveredByBaseline() from scope HelloWorldTest

/home/barney/projects/infection-static-analysis-plugin/test/asset/ProjectWithPsalmBaseline/tests/HelloWorldTest.php:13

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] DecrementInteger
asset/ProjectWithPsalmBaseline/src/HelloWorld.php:12:9
 {
     public function takesImplictMixedReturnsIntAndIsCoveredByBaseline($mixture): int
     {
-        return $mixture + 2;
+        return $mixture + 1;
     }
 }
statusReason: PHPUnit 10.5.1 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.1.12-1ubuntu4.3
Configuration: /tmp/infection/phpunitConfiguration.362c892a8ec7d8782c4427adbed5607c.infection.xml

.                                                                   1 / 1 (100%)

Time: 00:00.002, Memory: 10.00 MB

[Killed] IncrementInteger
asset/ProjectWithPsalmBaseline/src/HelloWorld.php:12:9
 {
     public function takesImplictMixedReturnsIntAndIsCoveredByBaseline($mixture): int
     {
-        return $mixture + 2;
+        return $mixture + 3;
     }
 }
statusReason: PHPUnit 10.5.1 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.1.12-1ubuntu4.3
Configuration: /tmp/infection/phpunitConfiguration.d136f1faa27eac8c072f6e8070be3e14.infection.xml

.                                                                   1 / 1 (100%)

Time: 00:00.002, Memory: 10.00 MB
